Revit 2023 API
RebarShapeDrivenAccessor.SetLayoutAsSingle Method
 Sets the Layout Rule property of rebar set to Single.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2018
Syntax
C#
public void SetLayoutAsSingle()
Visual Basic
Public Sub SetLayoutAsSingle
Visual C++
public:
void SetLayoutAsSingle()
Remarks
 Only one bar will remain, which is at the position of rebar plane
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace